#+title: 项目说明

* 说明
  个人关于金融交易的程序库，pixiu指貔貅，招财进宝的吉祥兽!该库将包含A股数据下载的函数，以及简化计算的python辅助函数等.

* 安装
  1. 获取代码
     #+begin_src bash
       git pull https://github.com/csfreebird/pixiu.git
     #+end_src
  2. 安装到本地python环境中     
     #+begin_src bash
       cd pixiu
       python setup.py install
     #+end_src
  3. 测试使用
     #+begin_src python :results output
       from pixiu import date
       s, e = date.get_date_range()
       print(s, ":", e)
     #+end_src

     #+RESULTS:
     : 2022-01-23 : 2022-01-29
     
